InformationRegisters/ТекущийЗаказНаСтанции.xml
<?xml version="1.0" encoding="UTF-8"?><MetaDataObject version="2.18">	<InformationRegister>		<InternalInfo>			<xr:GeneratedType name="InformationRegisterRecord.ТекущийЗаказНаСтанции" category="Record">				<xr:TypeId>6c6257cf-7e08-42f5-b27f-24e1194c8806</xr:TypeId>				<xr:ValueId>dab09a1c-81da-4ee5-9d2a-4b8c70bd3f34</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterManager.ТекущийЗаказНаСтанции" category="Manager">				<xr:TypeId>258fdaa4-6c08-4980-bcaf-8bb15e4ee386</xr:TypeId>				<xr:ValueId>208a994e-e017-430d-9fe9-faecbc1efbdf</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterSelection.ТекущийЗаказНаСтанции" category="Selection">				<xr:TypeId>1bb97572-1d83-487c-9663-851d919cdc98</xr:TypeId>				<xr:ValueId>d8b48826-9682-429e-838f-f5a3aaba9b2c</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterList.ТекущийЗаказНаСтанции" category="List">				<xr:TypeId>0f59dbe7-e98a-4c74-9152-5ff0ebf78c21</xr:TypeId>				<xr:ValueId>5db5caf7-0725-4b4e-848d-821e3d49efc7</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordSet.ТекущийЗаказНаСтанции" category="RecordSet">				<xr:TypeId>395ad085-b8e5-4c9a-8b53-b5c6ef349622</xr:TypeId>				<xr:ValueId>f2ff7753-dcdd-42f5-9b94-53821f6827b0</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordKey.ТекущийЗаказНаСтанции" category="RecordKey">				<xr:TypeId>82d75e65-00e4-4400-b188-a9379ad92674</xr:TypeId>				<xr:ValueId>bac28adf-f150-4c7b-932f-369ed994b583</xr:ValueId>			</xr:GeneratedType>			<xr:GeneratedType name="InformationRegisterRecordManager.ТекущийЗаказНаСтанции" category="RecordManager">				<xr:TypeId>2c89902b-fb41-4ab2-872a-495492813eff</xr:TypeId>				<xr:ValueId>c5c76f3c-0a86-4de7-911b-16c554af6ba8</xr:ValueId>			</xr:GeneratedType>		</InternalInfo>		<Properties>			<Name>ТекущийЗаказНаСтанции</Name>			<Synonym>				<v8:item>					<v8:lang>ru</v8:lang>					<v8:content>Текущий заказ на станции</v8:content>				</v8:item>			</Synonym>			<Comment/>			<UseStandardCommands>true</UseStandardCommands>			<EditType>InDialog</EditType>			<DefaultRecordForm/>			<DefaultListForm/>			<AuxiliaryRecordForm/>			<AuxiliaryListForm/>			<StandardAttributes>				<xr:StandardAttribute name="Active">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="LineNumber">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Recorder">					<xr:LinkByType/>					<xr:FillChecking>DontCheck</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>				<xr:StandardAttribute name="Period">					<xr:LinkByType/>					<xr:FillChecking>ShowError</xr:FillChecking>					<xr:MultiLine>false</xr:MultiLine>					<xr:FillFromFillingValue>false</xr:FillFromFillingValue>					<xr:CreateOnInput>Auto</xr:CreateOnInput>					<xr:TypeReductionMode>TransformValues</xr:TypeReductionMode>					<xr:MaxValue xsi:nil="true"/>					<xr:ToolTip/>					<xr:ExtendedEdit>false</xr:ExtendedEdit>					<xr:Format/>					<xr:ChoiceForm/>					<xr:QuickChoice>Auto</xr:QuickChoice>					<xr:ChoiceHistoryOnInput>Auto</xr:ChoiceHistoryOnInput>					<xr:EditFormat/>					<xr:PasswordMode>false</xr:PasswordMode>					<xr:DataHistory>Use</xr:DataHistory>					<xr:MarkNegatives>false</xr:MarkNegatives>					<xr:MinValue xsi:nil="true"/>					<xr:Synonym/>					<xr:Comment/>					<xr:FullTextSearch>Use</xr:FullTextSearch>					<xr:ChoiceParameterLinks/>					<xr:FillValue xsi:nil="true"/>					<xr:Mask/>					<xr:ChoiceParameters/>				</xr:StandardAttribute>			</StandardAttributes>			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>			<WriteMode>Independent</WriteMode>			<MainFilterOnPeriod>false</MainFilterOnPeriod>			<IncludeHelpInContents>false</IncludeHelpInContents>			<DataLockControlMode>Managed</DataLockControlMode>			<FullTextSearch>DontUse</FullTextSearch>			<EnableTotalsSliceFirst>false</EnableTotalsSliceFirst>			<EnableTotalsSliceLast>false</EnableTotalsSliceLast>			<RecordPresentation/>			<ExtendedRecordPresentation/>			<ListPresentation/>			<ExtendedListPresentation/>			<Explanation/>			<DataHistory>DontUse</DataHistory>			<UpdateDataHistoryImmediatelyAfterWrite>false</UpdateDataHistoryImmediatelyAfterWrite>			<ExecuteAfterWriteDataHistoryVersionProcessing>false</ExecuteAfterWriteDataHistoryVersionProcessing>		</Properties>		<ChildObjects>			<Resource>				<Properties>					<Name>ОтсканированПолностью</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Отсканирован полностью</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>xs:boolean</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Resource>			<Attribute>				<Properties>					<Name>Заказ</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Заказ</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.Заказы</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>				</Properties>			</Attribute>			<Dimension>				<Properties>					<Name>РабочееМестоОператора</Name>					<Synonym>						<v8:item>							<v8:lang>ru</v8:lang>							<v8:content>Рабочее место оператора</v8:content>						</v8:item>					</Synonym>					<Comment/>					<Type>						<v8:Type>cfg:CatalogRef.РабочиеМестаОператоров</v8:Type>					</Type>					<PasswordMode>false</PasswordMode>					<Format/>					<EditFormat/>					<ToolTip/>					<MarkNegatives>false</MarkNegatives>					<Mask/>					<MultiLine>false</MultiLine>					<ExtendedEdit>false</ExtendedEdit>					<MinValue xsi:nil="true"/>					<MaxValue xsi:nil="true"/>					<FillFromFillingValue>false</FillFromFillingValue>					<FillValue xsi:nil="true"/>					<FillChecking>DontCheck</FillChecking>					<ChoiceFoldersAndItems>Items</ChoiceFoldersAndItems>					<ChoiceParameterLinks/>					<ChoiceParameters/>					<QuickChoice>Auto</QuickChoice>					<CreateOnInput>Auto</CreateOnInput>					<ChoiceForm/>					<LinkByType/>					<ChoiceHistoryOnInput>Auto</ChoiceHistoryOnInput>					<Master>false</Master>					<MainFilter>true</MainFilter>					<DenyIncompleteValues>false</DenyIncompleteValues>					<Indexing>DontIndex</Indexing>					<FullTextSearch>Use</FullTextSearch>					<DataHistory>Use</DataHistory>					<TypeReductionMode>TransformValues</TypeReductionMode>				</Properties>			</Dimension>		</ChildObjects>	</InformationRegister></MetaDataObject>

InformationRegisters/ТекущийЗаказНаСтанции/Ext/ManagerModule.bsl
Функция ПолучитьТекущийЗаказ(РабочееМестоОператора, ИгнорироватьСтатус) Экспорт
	
	Заказ = Справочники.Заказы.ПустаяСсылка();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТекущийЗаказНаСтанции.Заказ
		|ИЗ
		|	РегистрСведений.ТекущийЗаказНаСтанции КАК ТекущийЗаказНаСтанции
		|ГДЕ
		|	ТекущийЗаказНаСтанции.РабочееМестоОператора = &РабочееМестоОператора
		|	И НЕ ТекущийЗаказНаСтанции.ОтсканированПолностью";
	
	Если ИгнорироватьСтатус = Истина Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И НЕ ТекущийЗаказНаСтанции.ОтсканированПолностью", "");	
	КонецЕсли;
		
	Запрос.УстановитьПараметр("РабочееМестоОператора", РабочееМестоОператора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Заказ = ВыборкаДетальныеЗаписи.Заказ;
		
	КонецЦикла;
	
	Возврат Заказ;
	
КонецФункции

Процедура СохранитьСостояниеЗаказа(РабочееМестоОператора, Заказ, ОтканированПолностью) Экспорт

	НоваяЗапись = РегистрыСведений.ТекущийЗаказНаСтанции.СоздатьМенеджерЗаписи();
	НоваяЗапись.РабочееМестоОператора = РабочееМестоОператора;
	НоваяЗапись.Заказ = Заказ;
	НоваяЗапись.ОтсканированПолностью = ОтканированПолностью;
	НоваяЗапись.Записать(Истина);

КонецПроцедуры
